Revit 2027 API
RevitLinkType.CreateFromIFC(Document, ExternalResourceReference, String, Boolean, RevitLinkOptions) Method
 Creates a new Revit link type from an existing Revit file created via import by reference of an asscoiated IFC file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LinkLoadResult CreateFromIFC(
	Document document,
	ExternalResourceReference resourceReference,
	string revitLinkedFilePath,
	bool recreateLink,
	RevitLinkOptions options
)
Public Shared Function CreateFromIFC (
	document As Document,
	resourceReference As ExternalResourceReference,
	revitLinkedFilePath As String,
	recreateLink As Boolean,
	options As RevitLinkOptions
) As LinkLoadResult
public:
static LinkLoadResult^ CreateFromIFC(
	Document^ document,
	ExternalResourceReference^ resourceReference,
	String^ revitLinkedFilePath,
	bool recreateLink,
	RevitLinkOptions^ options
)
static member CreateFromIFC :
        document : Document *
        resourceReference : ExternalResourceReference *
        revitLinkedFilePath : string *
        recreateLink : bool *
        options : RevitLinkOptions -> LinkLoadResult
Parameters
document Document
 The document in which to create the Revit link.
resourceReference ExternalResourceReference
 An external resource reference describing the source of the IFC file used in creation.
revitLinkedFilePath String
 The path of the existing Revit file that contains elements created via an import by reference operation. This must be a full path.
recreateLink Boolean
 If true, the existing Revit file created via an import by reference operation will be updated based on the information in the IFC file. If false, the existing Revit file will be used as-is.
options RevitLinkOptions
 An options class for loading Revit links.
Return Value
LinkLoadResult
 An object containing the results of creating and loading the Revit link type. It contains the ElementId of the new link.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- document already contains a linked model at path revitLinkedFilePath. -or- The server referenced by the ExternalResourceReference does not exist or does not implement IExternalResourceServer. -or- The server referenced by the ExternalResourceReference cannot support IFC links. -or- The ExternalResourceReference (resourceReference) is not in a format that is supported by its server.
ArgumentNullException |  A non-optional argument was null
FileAccessException |  The model cannot be accessed due to lack of access privileges.
FileArgumentNotFoundException |  There is not a valid Revit file at revitLinkedFilePath's location
InvalidOperationException |  The file is not allowed to access. -or- Revit cannot customize worksets for this model.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
This function is one of a series of steps necessary for linking an IFC file. To understand how it is used in context, please download the IFC open source code, and look in the Revit.IFC.Import project at Importer.ImportIFC(ImporterIFC importer), under the IFCImportAction.Link branch.
 This function regenerates the input document. While the options argument allows specification of a path type, the input path argument must be a full path. Relative vs. absolute determines how Revit will store the path, but it needs a complete path to find the linked document initially.
See Also
Reference
RevitLinkType Class
CreateFromIFC Overload
Autodesk.Revit.DB Namespace